uliano/brio/stm32f4/src/apps/test_stm32f4_misc.cpp
// test_stm32f4_misc - the reference bench suite for the STM32F4's three
// SMALL blocks: the CRC calculation unit, the random number generator and
// the bxCAN controller. They share a suite because none of them fills one
// and because all three are measurable with nothing attached.
//
// A test_<target>_<subject> suite is a menu of single-letter tests over
// the console, judged by brio's "ALL: N pass, M fail" grammar
// (util/testbench.hpp owns that grammar). It is a REFERENCE test: it is
// meant to keep passing through every later restructuring of the code
// under it.
//
// NOTHING TO WIRE, AND ONE PAD PER NODE TO CLAIM. The CRC unit is pure
// arithmetic and the generator is analog and internal. The CAN controller
// has LOOPBACK mode (RM0390 30.5.2), in which the node receives its own
// frames through an internal feedback - a whole transmit-filter-receive
// path with no transceiver and no peer - but letter c measures that it
// STILL needs eleven recessive bits on its RECEIVE PAD before it will
// leave initialization mode, so each instance claims its own CAN_RX pad
// as an input with its pull-up and never drives anything: the pad's own
// pull-up is a bus with nobody on it. That also makes the error-counter
// letter possible, which asks what happens when nobody acknowledges.
// Which pads those are belongs to the BOARD, so the CAN letters exist
// only where this file names ones the board leaves free.
//
// What is exercised, letter by letter:
//   a  the CRC unit: the reset value, one word, a run, the running value
//      composed, the silicon against the software model, CRC_IDR across
//      both kinds of reset, and the cost of a word
//   b  the generator (only on a part that has one): the clock domain, the
//      first-value discard, ten thousand words with their bit balance and
//      a byte-bucket spread, the throughput, the flags and the recovery
//   c  the CAN block: the reset state, the three modes and their
//      acknowledges, the master reset, the option bits and the one the
//      errata forbid
//   d  the bit timing: the search's exactness against CAN_BTR read back,
//      and the register's refusal outside initialization mode
//   e  loopback: every data length, both identifier formats and a remote
//      frame, round-tripped byte-exact
//   f  the filters: the four shapes admitting and rejecting, the filter
//      match index each reports, and the bank range each instance owns
//   g  the transmit scheduler: three mailboxes loaded at once, by
//      identifier and by request order
//   h  the receive FIFO: pending, full, overrun, and which message the
//      lock bit saves
//   i  four bit rates measured in loopback against the arithmetic
//   j  the recessive bus (needs the receive pad): silent mode cannot
//      transmit at all, and in normal mode with nobody to acknowledge the
//      error counter climbs to bus-off and comes back
//   k  CAN2: the shared filter block, the start bank that splits it, and
//      the slave's own loopback
//
// build: boards = f429zi,f446re,f411ce
// build: monitor_speed = 115200

#include <stdint.h>

#include <optional>

#include "stm32f4/can.hpp"
#include "stm32f4/clock.hpp"
#include "stm32f4/crc.hpp"
#include "stm32f4/delay.hpp"
#include "stm32f4/nvic.hpp"
#include "stm32f4/pin.hpp"
#include "stm32f4/platform.hpp"
#include "stm32f4/rng.hpp"
#include "stm32f4/ticker.hpp"
#include "stm32f4/usart.hpp"
#include "util/print.hpp"
#include "util/testbench.hpp"

#if defined(STM32F411xE)
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 100'000'000, 25'000'000>;
#elif defined(STM32F429xx)
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 180'000'000, 8'000'000>;
#else
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 180'000'000, 8'000'000, brio::HseMode::bypass>;
#endif
constexpr SysClock clock;

namespace {

using namespace brio;

using P = Stm32f4Platform<>;

#if defined(STM32F429xx)
using Led = Pin<'G', 13>;
constexpr UartPins console_pins{.tx = {'A', 9, PinFunction::af7}, .rx = {'A', 10, PinFunction::af7}};
constexpr uint8_t console_instance = 1;
#elif defined(STM32F411xE)
using Led = Pin<'C', 13>;
constexpr UartPins console_pins{.tx = {'A', 9, PinFunction::af7}, .rx = {'A', 10, PinFunction::af7}};
constexpr uint8_t console_instance = 1;
#else
using Led = Pin<'A', 5>;
constexpr UartPins console_pins{.tx = {'A', 2, PinFunction::af7}, .rx = {'A', 3, PinFunction::af7}};
constexpr uint8_t console_instance = 2;
#endif

using Serial = Uart<console_instance, console_pins>;
constexpr Serial serial;

TestBench<Serial> bench;

/// SysTick's counter as this suite's ruler: the same VAL-delta
/// accumulation the platform suite measures delay_us with, wrapped in a
/// bounded wait. Nothing (0 cycles) when the predicate never came true
/// inside `timeout_ms`.
template <typename Pred>
std::optional<uint32_t> timed_wait(Pred pred, uint32_t timeout_ms) {
    const uint32_t period = SysTick->LOAD + 1u;
    const uint32_t t0 = Ticker::ticks();
    uint32_t last = SysTick->VAL;
    uint32_t acc = 0;
    for (;;) {
        const uint32_t now = SysTick->VAL;
        acc += (last >= now) ? (last - now) : (last + period - now);
        last = now;
        if (pred()) {
            return acc;
        }
        if (Ticker::ticks() - t0 > timeout_ms) {
            return std::nullopt;
        }
    }
}

constexpr uint32_t cycles_per_us = SysClock::hz / 1'000'000u;

// =============================================================================
// a - the CRC calculation unit
// =============================================================================

// A message with no structure to it: a run of words a software model and
// a hardware unit must agree on to the bit.
constexpr uint32_t message[16] = {
    0x00000000u, 0xFFFFFFFFu, 0x12345678u, 0x9ABCDEF0u, 0x0F0F0F0Fu, 0xF0F0F0F0u,
    0xDEADBEEFu, 0xCAFEBABEu, 0x00000001u, 0x80000000u, 0x55555555u, 0xAAAAAAAAu,
    0x01234567u, 0x89ABCDEFu, 0xFEDCBA98u, 0x76543210u,
};

