uliano/brio/stm32f4/src/apps/test_stm32f4_misc.cpp
void ta_crc() {
    Crc::init();
    bench.verdict("the AHB1 gate reads back on", Crc::clock());

    print(serial, "  CRC_DR after a reset ", hex(Crc::value()), crlf);
    bench.verdict("a reset leaves the initial value 0xFFFFFFFF in CRC_DR",
                  Crc::value() == crc32_ethernet_init);

    // HOW LATE THE RESET IS. Put something else in CRC_DR, ask for the
    // reset, and count the reads of CRC_DR it takes before the initial
    // value appears - which is also what the driver's reset() waits for,
    // because a word written before it lands is swallowed with no flag.
    Crc::feed(0xDEADBEEFu);
    const uint8_t spins = Crc::reset();
    print(serial, "  the reset landed after ", spins, " extra read(s) of CRC_DR", crlf);
    bench.verdict("the reset lands, and inside the driver's bound",
                  spins < Crc::reset_spins && Crc::value() == crc32_ethernet_init);

    // One word, against the model - and the model is pinned to the
    // published CRC-32/MPEG-2 check value in test/family_stm32f4/crc.cpp.
    (void)Crc::reset();
    Crc::feed(0x12345678u);
    const uint32_t one = Crc::value();
    print(serial, "  one word 0x12345678 -> ", hex(one), " (model ",
          hex(crc32_ethernet(&message[2], 1)), ")", crlf);
    bench.verdict("one word is the CRC-32/MPEG-2 of its four bytes, most "
                  "significant first",
                  one == crc32_ethernet(&message[2], 1));

    // The whole run.
    const uint32_t whole = Crc::compute(message, 16);
    print(serial, "  sixteen words -> ", hex(whole), " (model ", hex(crc32_ethernet(message, 16)),
          ")", crlf);
    bench.verdict("a run of sixteen words agrees with the model",
                  whole == crc32_ethernet(message, 16));

    // Reading does not consume: the running value composes, which is what
    // makes a checksum in pieces the same as a checksum in one go.
    (void)Crc::reset();
    Crc::feed(message, 8);
    const uint32_t half = Crc::value();
    (void)half;
    Crc::feed(message + 8, 8);
    bench.verdict("a checksum taken in two halves, with a READ between them, "
                  "is the checksum of the whole",
                  Crc::value() == whole);

    // The empty message.
    (void)Crc::reset();
    bench.verdict("an empty message is the initial value", Crc::value() == crc32_ethernet_init);

    // CRC_IDR: eight bits of scratch that the RESET bit does not touch and
    // the peripheral's reset line does. The device header declares the
    // register as a BYTE where RM0390 4.4 asks for word accesses; this is
    // what the silicon does with the header's store.
    Crc::idr(0x5Au);
    const uint8_t idr_written = Crc::idr();
    (void)Crc::reset();
    const uint8_t idr_after_reset = Crc::idr();
    Crc::reset_block();
    const uint8_t idr_after_block = Crc::idr();
    const uint32_t dr_after_block = Crc::value();
    print(serial, "  CRC_IDR written 0x5A, read ", hex(idr_written), "; after CRC_CR.RESET ",
          hex(idr_after_reset), "; after the RCC reset line ", hex(idr_after_block), crlf);
    bench.verdict("a BYTE store into CRC_IDR sticks (the header's access width)",
                  idr_written == 0x5Au);
    bench.verdict("CRC_CR.RESET leaves CRC_IDR alone", idr_after_reset == 0x5Au);
    bench.verdict("the peripheral's reset line clears CRC_IDR and CRC_DR",
                  idr_after_block == 0u && dr_after_block == crc32_ethernet_init);

    // What a word costs. RM0390 4.2 says the computation takes four AHB
    // cycles and 4.3 says the write stalls until it is done, so the loop's
    // own overhead is what the measurement adds to that.
    Crc::clock(true);
    (void)Crc::reset();
    static constexpr uint32_t words = 1024;
    const uint32_t period = SysTick->LOAD + 1u;
    uint32_t last = SysTick->VAL;
    uint32_t acc = 0;
    for (uint32_t i = 0; i < words; ++i) {
        Crc::feed(message[i & 15u]);
    }
    const uint32_t now = SysTick->VAL;
    acc = (last >= now) ? (last - now) : (last + period - now);
    last = now;
    const uint32_t per_word_tenths = (acc * 10u) / words;
    print(serial, "  ", words, " words in ", acc, " core cycles = ", per_word_tenths / 10u, ".",
          per_word_tenths % 10u, " cycles a word at ", SysClock::hz / 1'000'000u, " MHz", crlf);
    bench.verdict("a word costs at least the chapter's four AHB cycles",
                  per_word_tenths >= 40u);
}

// =============================================================================
// b - the random number generator
// =============================================================================
#if defined(RNG_BASE)

void tb_rng() {
    print(serial, "  the 48 MHz domain (PLL Q) is at ", SysClock::usb_hz / 1'000'000u, " MHz, HCLK/16 is ",
          SysClock::hz / 16u / 1'000'000u, " MHz", crlf);
    bench.verdict("the clock the generator runs on clears RM0090 24.4.2's "
                  "f(HCLK)/16 bar",
                  rng_clock_ratio_ok(SysClock::usb_hz, SysClock::hz));

    const bool up = Rng::init(clock);
    print(serial, "  RNG_CR ", hex(Rng::regs().CR), " RNG_SR ", hex(Rng::regs().SR), crlf);
    bench.verdict("the generator comes up and hands out its first word "
                  "(discarded, as FIPS PUB 140-2 asks)",
                  up);
    bench.verdict("neither error status stands", !Rng::seed_error() && !Rng::clock_error());
    bench.verdict("and neither latched flag either",
                  !Rng::seed_error_flag() && !Rng::clock_error_flag());

    // Ten thousand words: the bit balance and a spread over the sixteen
    // buckets the low nibble picks. NOT a test of randomness - a chi
    // square over 10000 samples says almost nothing - but a test that the
    // datapath is not stuck, not repeating and not biased grossly.
    static constexpr uint32_t count = 10'000;
    uint32_t ones = 0;
    uint32_t buckets[16] = {};
    uint32_t taken = 0;
    uint32_t repeats = 0;
    uint32_t last_word = 0;
    const uint32_t t0 = Ticker::ticks();
    for (uint32_t i = 0; i < count; ++i) {
        const auto v = Rng::read_blocking();
        if (!v) {
            if (Rng::last_error() == RngError::repeated) {
                ++repeats;
                continue;
            }
            break;
        }
        ++taken;
        last_word = *v;
        ones += static_cast<uint32_t>(__builtin_popcount(*v));
        ++buckets[*v & 15u];
    }
    const uint32_t ms = Ticker::ticks() - t0;
    const uint32_t bits = taken * 32u;
    const uint32_t per_mille = bits == 0u ? 0u : (ones * 1000u) / bits;
    uint32_t lo = 0xFFFFFFFFu, hi = 0;
    for (uint8_t i = 0; i < 16u; ++i) {
        if (buckets[i] < lo) {
            lo = buckets[i];
        }
        if (buckets[i] > hi) {
            hi = buckets[i];
        }
    }
    print(serial, "  ", taken, " words in ", ms, " ms; ones ", per_mille,
          " per mille of ", bits, " bits; low-nibble buckets ", lo, "..", hi, " (", taken / 16u,
          " expected); the last word ", hex(last_word), crlf);
    bench.verdict("ten thousand words came out", taken == count);
    bench.verdict("no two consecutive words were equal (the continuous test)", repeats == 0u);
    bench.verdict("the bit balance is within one per cent of a half",
                  per_mille >= 490u && per_mille <= 510u);
    bench.verdict("no low-nibble bucket is empty and none holds a quarter of "
                  "the sample",
                  lo > 0u && hi < taken / 4u);
    if (ms != 0u) {
        print(serial, "  throughput ", taken / ms, " words a millisecond (", rng_clocks_per_word,
              " RNG_CLK periods a word is ", (SysClock::usb_hz / rng_clocks_per_word) / 1000u,
              " a millisecond at this rate)", crlf);
    }

    // DRDY goes down with the read and comes back on its own.
    (void)Rng::value();
    const bool cleared = !Rng::ready();
    const auto back = timed_wait([] { return Rng::ready(); }, 5u);
    print(serial, "  DRDY after a read: ", cleared ? "clear" : "still set", "; back in ",
          back ? *back / cycles_per_us : 0u, " us", crlf);
    bench.verdict("reading RNG_DR clears DRDY and the next word raises it again",
                  cleared && back.has_value());

