uliano/brio/stm32f4/src/apps/test_stm32f4_misc.cpp
    // The latched flags are rc_w0: a store of a ZERO clears them, and the
    // driver's verbs are what get that right.
    Rng::clear_seed_error();
    Rng::clear_clock_error();
    bench.verdict("the two latched flags clear (rc_w0, not rc_w1)",
                  !Rng::seed_error_flag() && !Rng::clock_error_flag());

    // The recovery sequence of 24.3.2 must be harmless when nothing is
    // wrong: clear, disable, enable, discard.
    bench.verdict("the seed-error recovery sequence brings the generator back "
                  "even when it had not failed",
                  Rng::recover());

    Rng::enable(false);
    bench.verdict("disabled, the generator stops offering words",
                  !Rng::enabled() && !Rng::read().has_value());
    Rng::release();
    bench.verdict("released, the clock gate is shut", !Rng::clock());
}

#endif // RNG_BASE

// =============================================================================
// The CAN letters
// =============================================================================
//
// THEY NEED ONE PAD, AND ONLY THE RECEIVER'S. Letter c measures why: even
// in loopback the node will not leave initialization mode until it has
// seen eleven recessive bits ON ITS RECEIVE PAD, so a suite with no wire
// still has to claim CAN1_RX and let the pad's own pull-up hold it
// recessive. The transmit pad is deliberately NOT claimed - the chip
// drives nothing at all, and the loopback carries the frames.
//
// Which pad that is belongs to the board, so these letters exist only
// where this file names one that the board leaves free. On the
// Nucleo-F446RE that is PA11 (DS10693 table 11: CAN1_RX on AF9; UM1724
// leaves the pad on the extension connector).
#if defined(CAN1_BASE) && defined(STM32F446xx)

using Bus = Can<1>;

constexpr uint32_t can_pclk = apb_hz(clock, false);
constexpr PinSel can_rx_pad{'A', 11, PinFunction::af9};

/// Bring CAN1 up at `bitrate`, with an accept-all filter in bank 0 feeding
/// FIFO 0. `loopback` and `silent` are CAN_BTR's two test bits.
bool can_up(uint32_t bitrate, bool loopback, bool silent, const CanOptions& o = CanOptions{}) {
    Bus::clock(true);
    Bus::filter_clock(true);
    Bus::claim_rx_pad<can_rx_pad>(PinPull::up);
    Bus::master_reset();
    if (!Bus::init_mode(true)) {
        return false;
    }
    if (!Bus::options(o)) {
        return false;
    }
    const CanTiming t = can_timing_for(can_pclk, bitrate);
    if (!Bus::timing(t, loopback, silent)) {
        return false;
    }
    (void)Bus::filter_init(true);
    (void)Bus::filters_off();
    (void)Bus::filter(can_filter_accept_all(0, 0));
    (void)Bus::filter_init(false);
    return Bus::start();
}

/// Send one frame and wait for the mailbox to report; then wait for the
/// loopback copy. Nothing when either wait timed out.
std::optional<CanFrame> can_round_trip(const CanFrame& out, uint32_t timeout_ms = 20u) {
    const auto mb = Bus::transmit(out);
    if (!mb) {
        return std::nullopt;
    }
    if (!timed_wait([&] { return Bus::result(*mb).completed; }, timeout_ms)) {
        return std::nullopt;
    }
    const bool ok = Bus::result(*mb).ok;
    (void)Bus::clear_result(*mb);
    if (!ok) {
        return std::nullopt;
    }
    if (!timed_wait([] { return Bus::pending(0) != 0u; }, timeout_ms)) {
        return std::nullopt;
    }
    return Bus::receive(0);
}

bool frames_equal(const CanFrame& a, const CanFrame& b) {
    if (a.id != b.id || a.extended != b.extended || a.remote != b.remote || a.dlc != b.dlc) {
        return false;
    }
    if (a.remote) {
        return true;   // a remote frame carries no data
    }
    for (uint8_t i = 0; i < a.dlc; ++i) {
        if (a.data[i] != b.data[i]) {
            return false;
        }
    }
    return true;
}

/// Bring the block from a master reset to normal mode in one test mode or
/// the other, and say whether it got there. What this really asks is
/// whether the receiver saw eleven recessive bits with nothing attached.
bool try_start(bool loopback, bool silent) {
    Bus::master_reset();
    if (!Bus::init_mode(true)) {
        return false;
    }
    if (!Bus::timing(can_timing_for(can_pclk, 1'000'000u), loopback, silent)) {
        return false;
    }
    return Bus::start() && Bus::in_normal();
}

// =============================================================================
// c - the block and its three modes
// =============================================================================
void tc_can_modes() {
    Bus::clock(true);
    Bus::filter_clock(true);
    Bus::master_reset();
    print(serial, "  after a master reset: MCR ", hex(Bus::regs().MCR), " MSR ",
          hex(Bus::regs().MSR), crlf);
    bench.verdict("the reset state is SLEEP, not normal (SLAK set, INAK clear)",
                  Bus::in_sleep() && !Bus::in_init());

    bench.verdict("initialization is requested and acknowledged", Bus::init_mode(true));
    bench.verdict("and it clears the sleep the reset left", Bus::in_init() && !Bus::in_sleep());

    // The options, all of them, read back.
    const CanOptions all{.time_triggered = false,
                         .auto_bus_off = true,
                         .auto_wakeup = true,
                         .no_retransmit = true,
                         .fifo_locked = true,
                         .tx_fifo_priority = true,
                         .debug_freeze = false};
    const bool wrote = Bus::options(all);
    const CanOptions back = Bus::options();
    bench.verdict("every option bit of CAN_MCR is written and reads back",
                  wrote && back.auto_bus_off && back.auto_wakeup && back.no_retransmit &&
                      back.fifo_locked && back.tx_fifo_priority && !back.debug_freeze);
    bench.verdict("and the mode request is not disturbed by writing them", Bus::in_init());

    // The one the errata forbid.
    const bool ttcm_refused = !Bus::options(CanOptions{.time_triggered = true});
    print(serial, "  time-triggered mode is ",
          Bus::time_triggered_supported() ? "not filed against this part class"
                                          : "refused (the errata sheet forbids it)",
          crlf);
    bench.verdict("TTCM is refused where the errata sheet read for this part "
                  "class says the mode does not work",
                  Bus::time_triggered_supported() != ttcm_refused);
    bench.verdict("and a refused configuration writes nothing", !Bus::options().time_triggered);

    // A timing is needed before the block can leave initialization, and a
    // test mode is what makes the exit possible with no bus: leaving
    // initialization costs eleven consecutive recessive bits on the
    // receiver's input, and WHICH INPUT THAT IS depends on the mode.
    const CanTiming t = can_timing_for(can_pclk, 1'000'000u);
    bench.verdict("CAN_BTR takes the timing while INAK stands", Bus::timing(t, true, true));

    // FOUR CASES, AND THEY SAY WHAT THE RECEIVER'S INPUT REALLY IS. 30.5.2
    // says loop back mode disregards "the actual value of the CANRX input
    // pin", which would make a pad unnecessary - and the silicon disagrees
    // about the SYNCHRONIZATION that leaves initialization mode. The two
    // judged cases are the two DEFINED ones: a pad held dominant and a pad
    // held recessive. An unclaimed pad is neither (its level is nobody's),
    // so its two results are printed and not judged.
    Pin<can_rx_pad.port, can_rx_pad.pin>::release();
    const bool no_pad = try_start(true, false);
    const bool no_pad_silent = try_start(true, true);
    Bus::claim_rx_pad<can_rx_pad>(PinPull::down);
    const bool pad_dominant = try_start(true, false);
    Bus::claim_rx_pad<can_rx_pad>(PinPull::up);
    const bool pad_recessive = try_start(true, false);
    print(serial, "  leaving initialization in loopback: pad unclaimed ",
          no_pad ? "yes" : "no", ", unclaimed + silent ", no_pad_silent ? "yes" : "no",
          " (both undefined - an unclaimed pad has no level); claimed and pulled DOWN ",
          pad_dominant ? "yes" : "no", ", claimed and pulled UP ",
          pad_recessive ? "yes" : "no", crlf);
    bench.verdict("a node in LOOPBACK still needs eleven recessive bits ON ITS "
                  "RECEIVE PAD to leave initialization mode - the pin is "
                  "disregarded for the DATA and not for the synchronization",
                  !pad_dominant && pad_recessive);
    bench.verdict("normal mode is reached: neither acknowledge stands", Bus::in_normal());
    print(serial, "  MSR ", hex(Bus::regs().MSR), ": RX reads ", Bus::rx_level() ? "1" : "0",
          ", the last sample point ", Bus::last_sample() ? "1" : "0", crlf);

