uliano/brio/stm32f4/src/apps/test_stm32f4_misc.cpp
    // Sleep and back, both acknowledged. Leaving sleep synchronizes too,
    // which is why this is done in loopback and not before it.
    bench.verdict("sleep is requested and acknowledged", Bus::sleep(true) && Bus::in_sleep());
    bench.verdict("and left again, which costs another synchronization",
                  Bus::sleep(false) && !Bus::in_sleep());
    Bus::clear_sleep_ack_flag();

    Bus::master_reset();
    bench.verdict("the master reset puts the block back in sleep with CAN_MCR "
                  "at its reset value",
                  Bus::in_sleep() && !Bus::options().auto_bus_off);
}

// =============================================================================
// d - the bit timing
// =============================================================================
void td_can_timing() {
    print(serial, "  PCLK1 is ", can_pclk / 1'000'000u, " MHz", crlf);

    static constexpr uint32_t rates[4] = {1'000'000u, 500'000u, 250'000u, 125'000u};
    bool all_exact = true;
    for (uint8_t i = 0; i < 4u; ++i) {
        const CanTiming t = can_timing_for(can_pclk, rates[i]);
        const uint32_t got = can_bitrate_of(can_pclk, t);
        print(serial, "  ", rates[i] / 1000u, " kbit/s: BRP ", t.brp, " TS1 ", t.ts1, " TS2 ",
              t.ts2, " SJW ", t.sjw, " = ", can_timing_quanta(t), " tq, sample point ",
              can_sample_point_of(t), " per mille, rate ", got, crlf);
        if (!can_timing_valid(t) || got != rates[i] || can_sample_point_of(t) < 750u ||
            can_sample_point_of(t) > 900u) {
            all_exact = false;
        }
    }
    bench.verdict("the search makes all four classic rates EXACTLY, with a "
                  "sample point between 75 and 90 per cent",
                  all_exact);

    // The register holds what the search found, in the chapter's off-by-one
    // encoding.
    const CanTiming t = can_timing_for(can_pclk, 500'000u);
    Bus::clock(true);
    Bus::master_reset();
    (void)Bus::init_mode(true);
    const bool wrote = Bus::timing(t, true, true);
    const CanTiming read_back = Bus::timing();
    print(serial, "  CAN_BTR ", hex(Bus::regs().BTR), crlf);
    bench.verdict("CAN_BTR reads back the timing that was written",
                  wrote && read_back.brp == t.brp && read_back.ts1 == t.ts1 &&
                      read_back.ts2 == t.ts2 && read_back.sjw == t.sjw);
    bench.verdict("and the two test-mode bits with it", Bus::loopback() && Bus::silent());

    // 30.9.1: the register is writable only in initialization mode, and
    // the driver refuses rather than let a silent drop happen.
    (void)Bus::start();
    const CanTiming other = can_timing_for(can_pclk, 125'000u);
    const bool refused = !Bus::timing(other, true, false);
    bench.verdict("a timing written outside initialization mode is REFUSED", refused);
    bench.verdict("and the register still holds the old one", Bus::timing().brp == t.brp);

    // A rate the APB clock cannot divide into exactly has no timing at all.
    bench.verdict("a rate this PCLK1 cannot make exactly has no timing",
                  !can_timing_valid(can_timing_for(can_pclk, 800'000u)) ||
                      can_bitrate_of(can_pclk, can_timing_for(can_pclk, 800'000u)) == 800'000u);
    Bus::master_reset();
}

// =============================================================================
// e - a frame round-trips in loopback
// =============================================================================
void te_can_loopback() {
    bench.verdict("the node comes up in loopback at 1 Mbit/s",
                  can_up(1'000'000u, true, false));

    // Every data length, byte-exact.
    bool all_dlc = true;
    for (uint8_t dlc = 0; dlc <= 8u; ++dlc) {
        CanFrame out{};
        out.id = 0x100u + dlc;
        out.dlc = dlc;
        for (uint8_t i = 0; i < dlc; ++i) {
            out.data[i] = static_cast<uint8_t>(0xA0u + i + dlc);
        }
        const auto in = can_round_trip(out);
        if (!in || !frames_equal(out, *in)) {
            all_dlc = false;
            print(serial, "  DLC ", dlc, ": ", in ? "wrong" : "no frame", crlf);
        }
    }
    bench.verdict("every data length from zero to eight round-trips byte-exact", all_dlc);

    // The extended format: twenty-nine bits through the same path.
    CanFrame ext{};
    ext.id = 0x1ABCDEF1u;
    ext.extended = true;
    ext.dlc = 8;
    for (uint8_t i = 0; i < 8u; ++i) {
        ext.data[i] = static_cast<uint8_t>(i * 17u);
    }
    const auto ext_in = can_round_trip(ext);
    print(serial, "  extended ", hex(ext.id), " -> ",
          ext_in ? hex(ext_in->id) : hex(uint32_t{0}), ext_in && ext_in->extended ? " (IDE)" : "",
          crlf);
    bench.verdict("a 29-bit identifier survives the round trip",
                  ext_in && frames_equal(ext, *ext_in));

    // The widest and the narrowest identifiers of each format.
    CanFrame edge{};
    edge.id = can_std_id_max;
    edge.dlc = 1;
    edge.data[0] = 0x5A;
    const auto edge_in = can_round_trip(edge);
    bench.verdict("the highest standard identifier round-trips",
                  edge_in && frames_equal(edge, *edge_in));
    edge.id = 0;
    const auto zero_in = can_round_trip(edge);
    bench.verdict("and identifier zero", zero_in && frames_equal(edge, *zero_in));

    // A remote frame: the request carries a length and no data.
    CanFrame rtr{};
    rtr.id = 0x321;
    rtr.remote = true;
    rtr.dlc = 4;
    const auto rtr_in = can_round_trip(rtr);
    print(serial, "  remote frame: ", rtr_in ? "received" : "none", " RTR ",
          rtr_in && rtr_in->remote ? "set" : "clear", " DLC ", rtr_in ? rtr_in->dlc : 0u, crlf);
    bench.verdict("a remote frame arrives with RTR set and its length intact",
                  rtr_in && rtr_in->remote && rtr_in->dlc == 4u && rtr_in->id == 0x321u);

    // A frame the vocabulary refuses never reaches a mailbox.
    CanFrame bad{};
    bad.id = 0x800;   // twelve bits, and the standard format has eleven
    bench.verdict("a frame with an identifier too wide for its format is "
                  "refused before the mailbox",
                  !Bus::transmit(bad).has_value());
    bad.id = 0;
    bad.dlc = 9;
    bench.verdict("and one with more than eight bytes", !Bus::transmit(bad).has_value());
    Bus::master_reset();
}

