uliano/brio/stm32f4/src/apps/test_stm32f4_misc.cpp
// =============================================================================
// f - the filters
// =============================================================================

/// Whether a frame with this identifier reaches FIFO 0, and with which
/// filter match index.
struct Admitted {
    bool arrived = false;
    uint8_t fmi = 0;
};

Admitted try_id(uint32_t id, bool extended = false, bool remote = false) {
    CanFrame out{};
    out.id = id;
    out.extended = extended;
    out.remote = remote;
    out.dlc = 1;
    out.data[0] = 0x11;
    const auto mb = Bus::transmit(out);
    Admitted a{};
    if (!mb) {
        return a;
    }
    if (!timed_wait([&] { return Bus::result(*mb).completed; }, 20u)) {
        return a;
    }
    (void)Bus::clear_result(*mb);
    // A frame the filters reject is transmitted and simply never stored;
    // a millisecond is a hundred bit times at this rate, so the absence is
    // decided and not merely early.
    if (!timed_wait([] { return Bus::pending(0) != 0u; }, 2u)) {
        return a;
    }
    const auto in = Bus::receive(0);
    if (in) {
        a.arrived = true;
        a.fmi = in->filter_index;
    }
    return a;
}

void tf_can_filters() {
    bench.verdict("the node comes up in loopback at 1 Mbit/s",
                  can_up(1'000'000u, true, false));

    print(serial, "  CAN1 owns banks ", Bus::first_bank(), "..", Bus::bank_limit() - 1u,
          " of ", Bus::filter_banks, " (CAN2SB reads ", Bus::start_bank(), ")", crlf);
    bench.verdict("a bank past the block's end is refused",
                  !Bus::filter(can_filter_accept_all(Bus::filter_banks)));

    // One 32-bit MASK filter: the top seven bits of the identifier must
    // match, the rest is don't-care.
    (void)Bus::filter_init(true);
    (void)Bus::filters_off();
    (void)Bus::filter(CanFilter{0, CanFilterScale::single32, CanFilterMode::mask, 0,
                                can_filter32(0x240u, false, false),
                                can_filter32(0x7F0u, false, false), true});
    (void)Bus::filter_init(false);
    const Admitted in_mask = try_id(0x24Au);
    const Admitted out_mask = try_id(0x250u);
    print(serial, "  32-bit mask 0x240/0x7F0: 0x24A ", in_mask.arrived ? "admitted" : "rejected",
          " (FMI ", in_mask.fmi, "), 0x250 ", out_mask.arrived ? "admitted" : "rejected", crlf);
    bench.verdict("a 32-bit mask filter admits what matches under the mask and "
                  "rejects what does not",
                  in_mask.arrived && !out_mask.arrived);

    // One 32-bit LIST filter bank: two identifiers, exactly.
    (void)Bus::filter_init(true);
    (void)Bus::filters_off();
    (void)Bus::filter(CanFilter{0, CanFilterScale::single32, CanFilterMode::list, 0,
                                can_filter32(0x111u, false, false),
                                can_filter32(0x222u, false, false), true});
    (void)Bus::filter_init(false);
    const Admitted list_a = try_id(0x111u);
    const Admitted list_b = try_id(0x222u);
    const Admitted list_c = try_id(0x333u);
    print(serial, "  32-bit list {0x111, 0x222}: FMI ", list_a.fmi, " and ", list_b.fmi,
          "; 0x333 ", list_c.arrived ? "admitted" : "rejected", crlf);
    bench.verdict("a 32-bit list bank admits its two identifiers and nothing else",
                  list_a.arrived && list_b.arrived && !list_c.arrived);
    bench.verdict("and the two halves report DIFFERENT filter match indices, "
                  "one apart",
                  list_b.fmi == list_a.fmi + 1u);

    // Four 16-bit LIST filters in one bank.
    (void)Bus::filter_init(true);
    (void)Bus::filters_off();
    (void)Bus::filter(CanFilter{0, CanFilterScale::dual16, CanFilterMode::list, 0,
                                can_filter16_pair(can_filter16(0x401u, false, false),
                                                  can_filter16(0x402u, false, false)),
                                can_filter16_pair(can_filter16(0x403u, false, false),
                                                  can_filter16(0x404u, false, false)),
                                true});
    (void)Bus::filter_init(false);
    const Admitted q1 = try_id(0x401u);
    const Admitted q4 = try_id(0x404u);
    const Admitted q5 = try_id(0x405u);
    print(serial, "  16-bit list {0x401..0x404}: FMI ", q1.fmi, " and ", q4.fmi, "; 0x405 ",
          q5.arrived ? "admitted" : "rejected", crlf);
    bench.verdict("a 16-bit list bank holds FOUR identifiers, each with its own "
                  "match index",
                  q1.arrived && q4.arrived && !q5.arrived && q4.fmi == q1.fmi + 3u);

    // Two 16-bit MASK filters in one bank: identifier and mask side by
    // side in each register.
    (void)Bus::filter_init(true);
    (void)Bus::filters_off();
    (void)Bus::filter(CanFilter{0, CanFilterScale::dual16, CanFilterMode::mask, 0,
                                can_filter16_pair(can_filter16(0x500u, false, false),
                                                  can_filter16(0x7F0u, false, false)),
                                can_filter16_pair(can_filter16(0x600u, false, false),
                                                  can_filter16(0x7FFu, false, false)),
                                true});
    (void)Bus::filter_init(false);
    const Admitted m1 = try_id(0x50Au);
    const Admitted m2 = try_id(0x600u);
    const Admitted m3 = try_id(0x601u);
    print(serial, "  16-bit mask {0x500/0x7F0, 0x600/0x7FF}: 0x50A ",
          m1.arrived ? "admitted" : "rejected", ", 0x600 ", m2.arrived ? "admitted" : "rejected",
          ", 0x601 ", m3.arrived ? "admitted" : "rejected", crlf);
    bench.verdict("two 16-bit mask filters in one bank each admit their own "
                  "group",
                  m1.arrived && m2.arrived && !m3.arrived);

    // A deactivated bank admits nothing, and nothing else is left to catch
    // the frame.
    (void)Bus::filter_active(0, false);
    bench.verdict("with every bank deactivated the hardware discards the frame "
                  "and the software never sees it",
                  !try_id(0x50Au).arrived);

