uliano/brio/stm32f4/src/apps/test_stm32f4_misc.cpp
    // A filter on FIFO 1.
    (void)Bus::filter_init(true);
    (void)Bus::filter(CanFilter{0, CanFilterScale::single32, CanFilterMode::mask, 1, 0u, 0u, true});
    (void)Bus::filter_init(false);
    CanFrame f1{};
    f1.id = 0x77;
    f1.dlc = 2;
    const auto mb = Bus::transmit(f1);
    const bool sent = mb && timed_wait([&] { return Bus::result(*mb).completed; }, 20u).has_value();
    if (mb) {
        (void)Bus::clear_result(*mb);
    }
    const bool on_one = timed_wait([] { return Bus::pending(1) != 0u; }, 5u).has_value();
    print(serial, "  a bank assigned to FIFO 1: FIFO 0 has ", Bus::pending(0), ", FIFO 1 has ",
          Bus::pending(1), crlf);
    bench.verdict("CAN_FFA1R sends the frame to the other FIFO",
                  sent && on_one && Bus::pending(0) == 0u);
    (void)Bus::receive(1);

    // The bank's whole configuration reads back.
    const auto held = Bus::filter(0);
    bench.verdict("a bank reads back the scale, mode, FIFO and activation it "
                  "was given",
                  held && held->scale == CanFilterScale::single32 &&
                      held->mode == CanFilterMode::mask && held->fifo == 1u && held->active);

    // A MASTER RESET DOES NOT TOUCH THE FILTER BLOCK (30.9.2 lists CAN_MCR
    // and the FMP bits and nothing else), so a letter that configured banks
    // puts them back itself.
    (void)Bus::filter_init(true);
    (void)Bus::filters_off();
    (void)Bus::filter_init(false);
    Bus::master_reset();
}

// =============================================================================
// g - the transmit scheduler
// =============================================================================

/// Load three mailboxes WHILE THE BLOCK IS IN INITIALIZATION MODE, where
/// no transfer starts, so that all three are pending the moment normal
/// mode is reached and the scheduler really has to choose.
bool load_three(bool by_request_order) {
    Bus::clock(true);
    Bus::filter_clock(true);
    Bus::master_reset();
    if (!Bus::init_mode(true)) {
        return false;
    }
    if (!Bus::options(CanOptions{.tx_fifo_priority = by_request_order})) {
        return false;
    }
    if (!Bus::timing(can_timing_for(can_pclk, 125'000u), true, false)) {
        return false;
    }
    (void)Bus::filter_init(true);
    (void)Bus::filters_off();
    (void)Bus::filter(can_filter_accept_all(0, 0));
    (void)Bus::filter_init(false);

    static constexpr uint32_t ids[3] = {0x300u, 0x100u, 0x200u};
    for (uint8_t i = 0; i < 3u; ++i) {
        CanFrame f{};
        f.id = ids[i];
        f.dlc = 1;
        f.data[0] = static_cast<uint8_t>(i);
        if (!Bus::transmit(f)) {
            return false;
        }
    }
    return Bus::free_mailboxes() == 0u && Bus::start();
}

void tg_can_priority() {
    // By identifier: the lowest goes first, whatever order the mailboxes
    // were loaded in.
    bool ok = load_three(false);
    uint32_t order[3] = {};
    for (uint8_t i = 0; i < 3u; ++i) {
        if (!timed_wait([] { return Bus::pending(0) != 0u; }, 50u)) {
            ok = false;
            break;
        }
        const auto f = Bus::receive(0);
        if (!f) {
            ok = false;
            break;
        }
        order[i] = f->id;
    }
    print(serial, "  loaded 0x300, 0x100, 0x200; by identifier they arrived ", hex(order[0]),
          " ", hex(order[1]), " ", hex(order[2]), crlf);
    bench.verdict("with TXFP clear the scheduler transmits by IDENTIFIER, "
                  "lowest first",
                  ok && order[0] == 0x100u && order[1] == 0x200u && order[2] == 0x300u);

    // By request order: the mailboxes go out as they were filled.
    ok = load_three(true);
    for (uint8_t i = 0; i < 3u; ++i) {
        if (!timed_wait([] { return Bus::pending(0) != 0u; }, 50u)) {
            ok = false;
            break;
        }
        const auto f = Bus::receive(0);
        if (!f) {
            ok = false;
            break;
        }
        order[i] = f->id;
    }
    print(serial, "  with TXFP set they arrived ", hex(order[0]), " ", hex(order[1]), " ",
          hex(order[2]), crlf);
    bench.verdict("with TXFP set it transmits in REQUEST order", ok && order[0] == 0x300u &&
                                                                     order[1] == 0x100u &&
                                                                     order[2] == 0x200u);

    // The mailbox bookkeeping: three free again, and TSR.CODE names the
    // next one.
    print(serial, "  free mailboxes ", Bus::free_mailboxes(), ", CODE names mailbox ",
          Bus::next_mailbox(), crlf);
    bench.verdict("all three mailboxes are empty when the queue has drained",
                  Bus::free_mailboxes() == 3u);

    // An abort while nothing is pending has no effect; one on a pending
    // request completes it.
    bench.verdict("an abort on an empty mailbox changes nothing",
                  Bus::abort(0) && Bus::mailbox_empty(0));
    Bus::master_reset();
}

// =============================================================================
// h - the receive FIFO and its overrun policy
// =============================================================================

/// Send `n` frames with identifiers 1..n WITHOUT draining, at a rate slow
/// enough that the software is never the bottleneck.
bool fill_fifo(uint8_t n) {
    for (uint8_t i = 1; i <= n; ++i) {
        CanFrame f{};
        f.id = i;
        f.dlc = 1;
        f.data[0] = i;
        const auto mb = Bus::transmit(f);
        if (!mb) {
            return false;
        }
        if (!timed_wait([&] { return Bus::result(*mb).completed; }, 50u)) {
            return false;
        }
        (void)Bus::clear_result(*mb);
    }
    return true;
}

void th_can_fifo() {
    // The lock CLEAR: the newest message overwrites the last one stored.
    bench.verdict("the node comes up with the receive FIFO unlocked",
                  can_up(1'000'000u, true, false, CanOptions{.fifo_locked = false}));
    bool ok = fill_fifo(4);
    print(serial, "  four frames into a three-deep FIFO: FMP ", Bus::pending(0), " FULL ",
          Bus::full(0) ? "1" : "0", " FOVR ", Bus::overrun(0) ? "1" : "0", crlf);
    bench.verdict("three are pending, FULL stands and FOVR records the fourth",
                  ok && Bus::pending(0) == 3u && Bus::full(0) && Bus::overrun(0));

    uint32_t got[3] = {};
    for (uint8_t i = 0; i < 3u; ++i) {
        const auto f = Bus::receive(0);
        got[i] = f ? f->id : 0u;
    }
    print(serial, "  unlocked, the FIFO held ", got[0], " ", got[1], " ", got[2], crlf);
    bench.verdict("with the lock clear the LAST STORED message is the one "
                  "overwritten - the newest survives",
                  got[0] == 1u && got[1] == 2u && got[2] == 4u);
    bench.verdict("the FIFO is empty once its three messages are released",
                  Bus::pending(0) == 0u);

