uliano/brio/stm32f4/src/apps/test_stm32f4_misc.cpp
    Bus::clear_full(0);
    Bus::clear_overrun(0);
    bench.verdict("FULL and FOVR are rc_w1 and clear", !Bus::full(0) && !Bus::overrun(0));

    // The lock SET: the newest is discarded and the three oldest survive.
    bench.verdict("the node comes up with the receive FIFO locked",
                  can_up(1'000'000u, true, false, CanOptions{.fifo_locked = true}));
    ok = fill_fifo(4);
    for (uint8_t i = 0; i < 3u; ++i) {
        const auto f = Bus::receive(0);
        got[i] = f ? f->id : 0u;
    }
    print(serial, "  locked, the FIFO held ", got[0], " ", got[1], " ", got[2], " (FOVR ",
          Bus::overrun(0) ? "1" : "0", ")", crlf);
    bench.verdict("with the lock set the NEWEST message is discarded and the "
                  "three oldest survive",
                  ok && got[0] == 1u && got[1] == 2u && got[2] == 3u);

    // Releasing an empty FIFO does nothing (30.9.2), and reading one gives
    // nothing.
    bench.verdict("releasing an empty FIFO is harmless and reading it gives "
                  "nothing",
                  Bus::release(0) && !Bus::receive(0).has_value());
    Bus::master_reset();
}

// =============================================================================
// i - four bit rates, measured
// =============================================================================
void ti_can_rates() {
    static constexpr uint32_t rates[4] = {1'000'000u, 500'000u, 250'000u, 125'000u};
    uint32_t measured_us[4] = {};
    bool all_ok = true;
    for (uint8_t i = 0; i < 4u; ++i) {
        if (!can_up(rates[i], true, false)) {
            all_ok = false;
            break;
        }
        CanFrame f{};
        f.id = 0x123;
        f.dlc = 8;
        for (uint8_t k = 0; k < 8u; ++k) {
            f.data[k] = static_cast<uint8_t>(0x5Au ^ k);   // some stuffing, not the worst case
        }
        const auto mb = Bus::transmit(f);
        if (!mb) {
            all_ok = false;
            break;
        }
        const auto cycles = timed_wait([&] { return Bus::result(*mb).completed; }, 100u);
        if (!cycles || !Bus::result(*mb).ok) {
            all_ok = false;
            break;
        }
        (void)Bus::clear_result(*mb);
        (void)Bus::receive(0);
        measured_us[i] = *cycles / cycles_per_us;
        const uint32_t nominal_us = (can_frame_bits(8, false) * 1'000'000u) / rates[i];
        print(serial, "  ", rates[i] / 1000u, " kbit/s: ", measured_us[i], " us for a frame of ",
              can_frame_bits(8, false), " bits (", nominal_us, " us unstuffed, ",
              nominal_us == 0u ? 0u : (measured_us[i] * 100u) / nominal_us, "%)", crlf);
        if (measured_us[i] < nominal_us || measured_us[i] > nominal_us * 3u / 2u) {
            all_ok = false;
        }
    }
    bench.verdict("a frame takes at least its unstuffed bit count at every "
                  "rate, and no more than half as much again (bit stuffing "
                  "adds at most one bit in five)",
                  all_ok);

    // The ratio between the slowest and the fastest is the ratio of the
    // bit times, whatever the stuffing did - a rate-independent verdict.
    if (measured_us[0] != 0u) {
        const uint32_t ratio_tenths = (measured_us[3] * 10u) / measured_us[0];
        print(serial, "  125 kbit/s takes ", ratio_tenths / 10u, ".", ratio_tenths % 10u,
              " times as long as 1 Mbit/s (8 due)", crlf);
        bench.verdict("the frame time scales with the bit time, eightfold from "
                      "1 Mbit/s to 125 kbit/s",
                      ratio_tenths >= 75u && ratio_tenths <= 85u);
    }
    Bus::master_reset();
}

// =============================================================================
// j - the recessive bus: silent mode, and nobody to acknowledge
// =============================================================================
//
// The receive pad pulled up is a bus with no other node on it, permanently
// recessive. CAN1_TX stays unclaimed, so the chip drives nothing at all:
// the transmitter's output goes nowhere and its own monitor sees the
// recessive pad, which is exactly the condition of a node talking to
// silence.
void tj_can_errors() {
    Bus::clock(true);
    Bus::claim_rx_pad<can_rx_pad>(PinPull::up);

    // SILENT ALONE: the node listens and cannot start a transmission
    // (30.5.1). The request stays in its mailbox until it is aborted.
    Bus::filter_clock(true);
    Bus::master_reset();
    bool up = Bus::init_mode(true);
    up = Bus::options(CanOptions{.no_retransmit = true}) && up;
    up = Bus::timing(can_timing_for(can_pclk, 125'000u), false, true) && up;
    up = Bus::start() && up;
    print(serial, "  silent mode, the pad pulled up: RX reads ", Bus::rx_level() ? "1" : "0",
          ", normal mode ", Bus::in_normal() ? "reached" : "NOT reached", crlf);
    bench.verdict("with the receive pad recessive the node synchronizes and "
                  "reaches normal mode", up && Bus::in_normal());
    bench.verdict("the receive line reads recessive", Bus::rx_level());

    CanFrame f{};
    f.id = 0x123;
    f.dlc = 1;
    f.data[0] = 0x5A;
    const auto mb = Bus::transmit(f);
    const bool stuck = mb && !timed_wait([&] { return Bus::result(*mb).completed; }, 20u);
    print(serial, "  a transmit request in silent mode after 20 ms: ",
          mb && Bus::mailbox_empty(*mb) ? "gone" : "still pending", crlf);
    bench.verdict("SILENT MODE CANNOT START A TRANSMISSION: the request stays "
                  "in its mailbox",
                  stuck && mb && !Bus::mailbox_empty(*mb));
    if (mb) {
        (void)Bus::abort(*mb);
        const bool emptied = timed_wait([&] { return Bus::mailbox_empty(*mb); }, 20u).has_value();
        bench.verdict("and an abort empties it", emptied);
        (void)Bus::clear_result(*mb);
    }
    bench.verdict("no error was counted: a node that never transmits never "
                  "fails to be acknowledged",
                  Bus::tec() == 0u);

    // NORMAL MODE AGAINST A RECESSIVE BUS. Now the node really transmits,
    // and nothing answers: every attempt fails, and with NART set each
    // request costs exactly one attempt.
    Bus::master_reset();
    up = Bus::init_mode(true);
    up = Bus::options(CanOptions{.auto_bus_off = false, .no_retransmit = true}) && up;
    up = Bus::timing(can_timing_for(can_pclk, 1'000'000u), false, false) && up;
    up = Bus::start() && up;
    bench.verdict("the node reaches normal mode with no loopback and no peer", up);

    uint32_t attempts = 0;
    uint8_t tec_first = 0;
    CanError lec = CanError::none;
    while (attempts < 64u && !Bus::bus_off()) {
        const auto m = Bus::transmit(f);
        if (!m) {
            break;
        }
        if (!timed_wait([&] { return Bus::result(*m).completed; }, 20u)) {
            (void)Bus::abort(*m);
            break;
        }
        const CanTxResult r = Bus::result(*m);
        (void)Bus::clear_result(*m);
        ++attempts;
        if (attempts == 1u) {
            tec_first = Bus::tec();
            lec = Bus::last_error();
        }
        if (r.ok) {
            break;   // somebody answered: this is not the bus we thought
        }
    }
    print(serial, "  after one failed attempt TEC is ", tec_first, ", last error code ",
          static_cast<uint8_t>(lec), " (5 = bit dominant error: the transmitter sent a "
          "dominant bit and monitored the pad's recessive one, so the failure comes "
          "before the acknowledge slot); bus-off after ", attempts,
          " attempts, TEC reads ", Bus::tec(),
          " - the register carries the low byte of a nine-bit counter, and what the "
          "error frames themselves cost is not the chapter's to say", crlf);
    bench.verdict("an unacknowledged attempt costs the transmit error counter a "
                  "MULTIPLE OF EIGHT - one for the failed frame, and one more "
                  "for each error flag the node cannot get out either",
                  tec_first >= 8u && (tec_first % 8u) == 0u);
    bench.verdict("the error warning and error passive flags are passed on the "
                  "way",
                  Bus::error_warning() && Bus::error_passive());
    bench.verdict("BUS-OFF is reached, in fewer than the 32 attempts eight at a "
                  "time would need (an error frame nobody sees costs the counter "
                  "too)",
                  Bus::bus_off() && attempts <= 32u);

    // With ABOM clear the node stays off the bus until software asks.
    (void)timed_wait([] { return false; }, 30u);
    print(serial, "  30 ms later, with ABOM clear, BOFF is ", Bus::bus_off() ? "still set" : "gone",
          crlf);
    bench.verdict("with ABOM clear the node stays bus-off with no software",
                  Bus::bus_off());

    // ABOM: the hardware leaves bus-off by itself once it has counted
    // 128 x 11 recessive bits - 1408 bit times, 1.4 ms at 1 Mbit/s.
    (void)Bus::init_mode(true);
    (void)Bus::options(CanOptions{.auto_bus_off = true, .no_retransmit = true});
    (void)Bus::start();
    const auto recovered = timed_wait([] { return !Bus::bus_off(); }, 200u);
    print(serial, "  with ABOM set the recovery took ",
          recovered ? *recovered / cycles_per_us : 0u, " us (1408 bit times is 1408 us at "
          "1 Mbit/s)", crlf);
    bench.verdict("ABOM brings the node back from bus-off with no software",
                  recovered.has_value());
    print(serial, "  after the recovery TEC ", Bus::tec(), " REC ", Bus::rec(), crlf);
    bench.verdict("and the error counters are back under the warning limit",
                  !Bus::error_passive());

    // The one writable field of CAN_ESR.
    Bus::mark_error();
    bench.verdict("the last-error field takes the software code that says "
                  "'nothing since'",
                  Bus::last_error() == CanError::set_by_software);

