uliano/brio/stm32f4/src/apps/test_stm32f4_misc.cpp
    Bus::master_reset();
}

// =============================================================================
// k - the second instance and the block they share
// =============================================================================
#if defined(CAN2_BASE)

using Slave = Can<2>;

// CAN2's own receive pad, for the same reason CAN1 needs one: a node
// leaves initialization mode only after eleven recessive bits on it. PB5
// is CAN2_RX on AF9 (DS10693 table 11) and free on this board.
constexpr PinSel can2_rx_pad{'B', 5, PinFunction::af9};

void tk_can2() {
    Slave::clock(true);
    Slave::filter_clock(true);   // CAN1's gate: the filters are its registers
    Slave::claim_rx_pad<can2_rx_pad>(PinPull::up);
    Bus::master_reset();
    Slave::master_reset();
    // Whatever an earlier letter left in the block: this letter is about
    // the two RANGES, so both start empty.
    (void)Slave::filter_init(true);
    (void)Bus::filters_off();
    (void)Slave::filters_off();
    (void)Slave::filter_init(false);

    print(serial, "  CAN2SB reads ", Slave::start_bank(), " out of reset; CAN1 owns banks 0..",
          Bus::bank_limit() - 1u, ", CAN2 banks ", Slave::first_bank(), "..",
          Slave::bank_limit() - 1u, crlf);
    bench.verdict("the two instances share one filter block, and CAN1 is its "
                  "master",
                  Slave::filter_master == 1u && Bus::filter_master == 1u);
    bench.verdict("the split reads back where it is written",
                  Slave::start_bank(14) && Slave::start_bank() == 14u);

    // The split is enforced by the driver, because the silicon does not:
    // each instance may only configure the banks on its own side of it.
    bench.verdict("CAN1 is refused a bank above the split",
                  !Bus::filter(can_filter_accept_all(14, 0)));
    bench.verdict("CAN2 is refused a bank below it",
                  !Slave::filter(can_filter_accept_all(13, 0)));
    bench.verdict("and each is allowed its own side",
                  Bus::bank_ok(13) && Slave::bank_ok(14) && !Slave::bank_ok(28));

    // CAN2 in loopback, filtering through a bank of CAN1's block.
    bool up = Slave::init_mode(true);
    up = Slave::timing(can_timing_for(can_pclk, 1'000'000u), true, false) && up;
    (void)Slave::filter_init(true);
    (void)Slave::filters_off();
    (void)Slave::filter(can_filter_accept_all(14, 0));
    (void)Slave::filter_init(false);
    up = Slave::start() && up;
    bench.verdict("CAN2 reaches normal mode in loopback", up);

    CanFrame out{};
    out.id = 0x2C2;
    out.dlc = 3;
    out.data[0] = 0xC2;
    out.data[1] = 0x55;
    out.data[2] = 0xAA;
    const auto mb = Slave::transmit(out);
    bool ok = mb && timed_wait([&] { return Slave::result(*mb).completed; }, 20u).has_value();
    if (mb) {
        ok = Slave::result(*mb).ok && ok;
        (void)Slave::clear_result(*mb);
    }
    ok = ok && timed_wait([] { return Slave::pending(0) != 0u; }, 20u).has_value();
    const auto in = Slave::receive(0);
    print(serial, "  CAN2 round trip: ", in ? "received id " : "nothing, id ",
          hex(in ? in->id : 0u), " FMI ", in ? in->filter_index : 0u, crlf);
    bench.verdict("a frame round-trips on CAN2 through a bank of the shared "
                  "block",
                  ok && in && in->id == out.id && in->dlc == out.dlc &&
                      in->data[2] == out.data[2]);
    print(serial, "  the filter match index CAN2 reports for the FIRST bank of "
                  "its own range is ", in ? in->filter_index : 0u, crlf);

    // CAN1's own filters are untouched by CAN2's: the two ranges do not
    // overlap.
    bench.verdict("CAN2's bank is active and CAN1's range is still empty",
                  Slave::filter_active(14) && !Bus::filter_active(0));

    Slave::master_reset();
    Slave::clock(false);
    Bus::master_reset();
}

#endif // CAN2_BASE
#endif // CAN1_BASE && STM32F446xx

void banner() {
    print(serial, crlf,
          "test_stm32f4_misc - the CRC unit, the random number generator and bxCAN", crlf);
    bench.menu();
}

} // namespace

// ---- target glue ------------------------------------------------------------
#if defined(STM32F446xx)
extern "C" void USART2_IRQHandler() { (void)Serial::isr(); }
#else
extern "C" void USART1_IRQHandler() { (void)Serial::isr(); }
#endif
extern "C" void SysTick_Handler() { brio::Ticker::tick(); }

int main() {
    const bool clock_ok = SysClock::init();
    const bool serial_ok = Serial::init(clock, 115200);
    const bool tick_ok = brio::Ticker::init(clock);
    Led::output();
    brio::enable_interrupts();

    bench.letter('a', "the CRC calculation unit against its own polynomial", ta_crc);
#if defined(RNG_BASE)
    bench.letter('b', "the random number generator", tb_rng);
#endif
#if defined(CAN1_BASE) && defined(STM32F446xx)
    bench.letter('c', "the CAN block and its three modes", tc_can_modes);
    bench.letter('d', "the bit timing, searched and read back", td_can_timing);
    bench.letter('e', "a frame round-trips in loopback", te_can_loopback);
    bench.letter('f', "the acceptance filters in their four shapes", tf_can_filters);
    bench.letter('g', "the transmit scheduler's two orders", tg_can_priority);
    bench.letter('h', "the receive FIFO and its overrun policy", th_can_fifo);
    bench.letter('i', "four bit rates measured against the arithmetic", ti_can_rates);
    bench.letter('j', "silent mode and the error counters on a recessive bus", tj_can_errors);
#if defined(CAN2_BASE)
    bench.letter('k', "CAN2 and the filter block the pair shares", tk_can2);
#endif
#endif

    if (serial_ok) {
        brio::print(serial, brio::crlf, "boot: clk=", clock_ok ? "PLL" : "FAILED",
                    " tick=", tick_ok ? "SysTick" : "FAILED", brio::crlf);
        banner();
        bench.prompt();
    }

    for (;;) {
        uint8_t c = 0;
        if (!Serial::read_byte(c)) {
            continue;
        }
        if (c == '\r' || c == '\n') {
            continue;
        }
        brio::print(serial, static_cast<char>(c), brio::crlf);
        Led::toggle();
        if (c == '?') {
            banner();
        } else if (!bench.handle(static_cast<char>(c))) {
            brio::print(serial, "unknown letter (? for the menu)", brio::crlf);
        }
        bench.prompt();
    }
}
